app/ThirdParty/myth-auth/src/Controllers/AuthController.php

INSERT INTO `users` (`password_hash`, `reset_hash`, `reset_at`, `reset_expires`, `email`, `username`, `active`, `activate_hash`, `created_at`, `updated_at`) VALUES ('$2y$10$F6s1LxbTVoNc2sihPrjAKO97d6b9lH9PYcROmSbSCpDqKCuzqP0Ta', NULL, NULL, NULL, 'sachrul95@gmail.com', 'sachrul95', 1, NULL, '2022-06-11 06:29:10', '2022-06-11 06:29:10')
---
            $users = $users->withGroup($this->config->defaultUserGroup);
        }

        if (! $users->save($user)) {