app/Controllers/Home.php

SELECT *
FROM `deputi`
---
    public function dashboard()
    {
    	$this->karyawan = new Karyawan();
    	$this->deputi = new Deputi();
	    $data['karyawan'] = $this->karyawan->getAll();
	    $data['deputi'] = $this->deputi->findAll();