app/Models/Deputi.php

    public function getAllText()
    {

        $text = '';

        $satu = $this->db->table($this->table)
         		->WHERE('parent_id',0)->get()->getResultArray();

        foreach ($satu as $key => $value) {
        	$level = 1;
        	$text .= '<tr data-id="'.$value['id_deputi'] .'" data-parent="'. $value['parent_id'] .'" data-level="'. $level .'">';
        		$text .= '<td data-column="name"><a href="javascript:void(0)" data-id="'.$value['id_deputi'] .'" onclick="showModal(this);">'.$value['nama_deputi'] .'</a></td>';
        		$text .= '<td>'.$value['extention'] .'</td>';
        		$dua = $this->db->table($this->table)
         				->WHERE('parent_id', $value['id_deputi'])->get();
---
SELECT *
FROM `deputi`
WHERE `parent_id` = 0
SELECT *
FROM `deputi`
WHERE `parent_id` = '1'

    function getTree($value, $level){
    	$text = '<tr data-id="'.$value['id_deputi'] .'" data-parent="'. $value['parent_id'] .'" data-level="'. $level .'">';
        $text .= '<td data-column="name"><a href="javascript:void(0)" data-id="'.$value['id_deputi'] .'" onclick="showModal(this);">'.$value['nama_deputi'] .'</a></td>';
        $text .= '<td>'.$value['extention'] .'</td>';
        	$tiga = $this->db->table($this->table)
         				->WHERE('parent_id', $value['id_deputi'])->get();
---
SELECT *
FROM `deputi`
WHERE `parent_id` = '2'