app/Models/Karyawan.php

SELECT *
FROM `karyawan`
JOIN `deputi` ON `deputi`.`id_deputi`=`karyawan`.`deputi`
---
    public function getAll()
    {
         return $this->db->table('karyawan')
         ->join('unit','unit.id=karyawan.id_unit')
         ->get()->getResultArray();